; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v12 ?v7)
             (pred_10 ?v10 ?v8)
             (pred_3 ?v12 ?v8)
             (pred_2 ?v5 ?v12 )
	     (pred_5 ?v12)
             (pred_8 ?v6)
             (pred_12 ?v10)
             (pred_6 ?v8)
             (pred_9 ?v12)
             (pred_7 ?v10)
             (pred_11 ?v12)
             (pred_1 ))



(:action op_5
:parameters (?v1 ?v13 ?v2 ?v9)
:precondition (and (pred_8 ?v1) (pred_8 ?v13) (pred_12 ?v2) (pred_6 ?v9)
          (pred_4 ?v1 ?v13) (pred_10 ?v2 ?v9)
                   (pred_3 ?v13 ?v9) (pred_5 ?v1) 
                   (pred_9 ?v13) (pred_7 ?v2))
:effect (and  (pred_11 ?v13) (not (pred_9 ?v13))))


(:action op_3
:parameters (?v1 ?v3)
:precondition (and (pred_8 ?v1) (pred_8 ?v3)
               (pred_5 ?v1) (pred_4 ?v1 ?v3) (pred_11 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v1))))

(:action op_2
:parameters (?v1 ?v2)
:precondition (and (pred_8 ?v1) (pred_12 ?v2) 
                  (pred_5 ?v1) (pred_2 ?v2 ?v1) (pred_1 ))
:effect (and (pred_7 ?v2)
   (not (pred_2 ?v2 ?v1)) (not (pred_1 ))))


(:action op_1
:parameters (?v1 ?v11 ?v4)
:precondition (and (pred_8 ?v1) (pred_12 ?v11) (pred_12 ?v4)
                  (pred_5 ?v1) (pred_7 ?v4) (pred_2 ?v11 ?v1))
:effect (and (pred_7 ?v11) (pred_2 ?v4 ?v1)
        (not (pred_7 ?v4)) (not (pred_2 ?v11 ?v1))))

(:action op_4
:parameters (?v1 ?v2)
:precondition (and (pred_8 ?v1) (pred_12 ?v2) 
                  (pred_5 ?v1) (pred_7 ?v2))
:effect (and (pred_1 ) (pred_2 ?v2 ?v1) (not (pred_7 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_19 obj_30 obj_05 obj_03 obj_16 obj_01 obj_07 obj_21 obj_18 obj_27 obj_25 obj_04 obj_09 obj_17 obj_26 obj_02 obj_29 obj_15 obj_24 obj_06 obj_14 obj_20 obj_22 obj_08
    obj_10 obj_13 obj_31
    obj_28 obj_12 obj_23
    )

    (:init
       (pred_1)

       (pred_8 obj_11)
       (pred_8 obj_19)
       (pred_8 obj_30)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_21)
       (pred_8 obj_18)
       (pred_8 obj_27)
       (pred_8 obj_25)
       (pred_8 obj_04)
       (pred_8 obj_09)
       (pred_8 obj_17)
       (pred_8 obj_26)
       (pred_8 obj_02)
       (pred_8 obj_29)
       (pred_8 obj_15)
       (pred_8 obj_24)
       (pred_8 obj_06)
       (pred_8 obj_14)
       (pred_8 obj_20)
       (pred_8 obj_22)
       (pred_8 obj_08)
       (pred_6 obj_10)
       (pred_6 obj_13)
       (pred_6 obj_31)
       (pred_12 obj_28)
       (pred_12 obj_12)
       (pred_12 obj_23)

       (pred_4 obj_11 obj_16)
       (pred_4 obj_11 obj_19)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_30)
       (pred_4 obj_19 obj_11)
       (pred_4 obj_30 obj_07)
       (pred_4 obj_30 obj_05)
       (pred_4 obj_30 obj_19)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_30)
       (pred_4 obj_03 obj_18)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_16 obj_27)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_01 obj_25)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_07 obj_21)
       (pred_4 obj_07 obj_30)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_21 obj_07)
       (pred_4 obj_18 obj_17)
       (pred_4 obj_18 obj_03)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_27 obj_26)
       (pred_4 obj_27 obj_25)
       (pred_4 obj_27 obj_16)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_25 obj_04)
       (pred_4 obj_25 obj_01)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_04 obj_29)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_25)
       (pred_4 obj_09 obj_15)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_17 obj_24)
       (pred_4 obj_17 obj_18)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_26 obj_06)
       (pred_4 obj_26 obj_02)
       (pred_4 obj_26 obj_27)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_02 obj_26)
       (pred_4 obj_29 obj_20)
       (pred_4 obj_29 obj_15)
       (pred_4 obj_29 obj_04)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_15 obj_24)
       (pred_4 obj_15 obj_09)
       (pred_4 obj_15 obj_29)
       (pred_4 obj_24 obj_08)
       (pred_4 obj_24 obj_17)
       (pred_4 obj_24 obj_15)
       (pred_4 obj_06 obj_14)
       (pred_4 obj_06 obj_26)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_06)
       (pred_4 obj_20 obj_22)
       (pred_4 obj_20 obj_29)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_22 obj_08)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_22 obj_20)
       (pred_4 obj_08 obj_24)
       (pred_4 obj_08 obj_22)
       (pred_9 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_3  obj_11 obj_10)
       (pred_3  obj_03 obj_13)
       (pred_3  obj_17 obj_31)
       (pred_11 obj_19)
       (pred_11 obj_30)
       (pred_11 obj_05)
       (pred_11 obj_16)
       (pred_11 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_25)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_26)
       (pred_11 obj_02)
       (pred_11 obj_29)
       (pred_11 obj_15)
       (pred_11 obj_24)
       (pred_11 obj_06)
       (pred_11 obj_14)
       (pred_11 obj_20)
       (pred_11 obj_22)
       (pred_11 obj_08)

       (pred_10  obj_28 obj_10)
       (pred_10  obj_12 obj_13)
       (pred_10  obj_23 obj_31)
       (pred_2 obj_28 obj_22)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_23 obj_05)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_2 obj_28 obj_07)
       (pred_2 obj_23 obj_26)
    ))
(:constraints
  (always (not (pred_5 obj_15)))
)
)

; plan
1. (op_3 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 0 of 2
2. (op_3 obj_01 obj_07)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_07)
   goals met: 0 of 2
3. (op_3 obj_07 obj_04)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_04)
   goals met: 0 of 2
4. (op_3 obj_04 obj_29)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_29)
   goals met: 0 of 2
5. (op_3 obj_29 obj_20)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_20)
   goals met: 0 of 2
6. (op_3 obj_20 obj_22)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_22)
   goals met: 0 of 2
7. (op_2 obj_22 obj_28)
   deleted: (pred_2 obj_28 obj_22) (pred_1)
   added: (pred_7 obj_28)
   goals met: 0 of 2
8. (op_3 obj_22 obj_20)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_20)
   goals met: 0 of 2
9. (op_3 obj_20 obj_29)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_29)
   goals met: 0 of 2
10. (op_3 obj_29 obj_04)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_04)
   goals met: 0 of 2
11. (op_3 obj_04 obj_07)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_07)
   goals met: 0 of 2
12. (op_4 obj_07 obj_28)
   deleted: (pred_7 obj_28)
   added: (pred_1) (pred_2 obj_28 obj_07)
   goals met: 1 of 2
13. (op_3 obj_07 obj_30)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_30)
   goals met: 1 of 2
14. (op_3 obj_30 obj_05)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_05)
   goals met: 1 of 2
15. (op_2 obj_05 obj_23)
   deleted: (pred_2 obj_23 obj_05) (pred_1)
   added: (pred_7 obj_23)
   goals met: 1 of 2
16. (op_3 obj_05 obj_30)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_30)
   goals met: 1 of 2
17. (op_3 obj_30 obj_19)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_19)
   goals met: 1 of 2
18. (op_3 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 1 of 2
19. (op_3 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 1 of 2
20. (op_3 obj_16 obj_27)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_27)
   goals met: 1 of 2
21. (op_3 obj_27 obj_26)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_26)
   goals met: 1 of 2
22. (op_4 obj_26 obj_23)
   deleted: (pred_7 obj_23)
   added: (pred_1) (pred_2 obj_23 obj_26)
   goals met: 2 of 2
